Tekla Open API Reference for Tekla Structures 2025
ProfileItem.GetHighAccuracyCrossSection Method
 Get cross section with high accuracy.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CrossSection GetHighAccuracyCrossSection(
	double RelativeLocation = 0
)
Public Function GetHighAccuracyCrossSection (
	Optional RelativeLocation As Double = 0
) As CrossSection
Parameters
RelativeLocation (Optional)
Type: System.Double
The relative location of the cross section, values between 0 (start of profile) and 1 (end of profile).
Return Value
Type: CrossSection
CrossSection object or null on failure.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace